#+TITLE: 2021-06-18
#+DATE: <2021-06-18 Fri>

** TODO look at cosmins code and write some more tests
:LOGBOOK:
CLOCK: [2021-08-10 Tue 11:36]--[2021-08-10 Tue 12:01] =>  0:25
CLOCK: [2021-08-10 Tue 11:03]--[2021-08-10 Tue 11:28] =>  0:25
CLOCK: [2021-08-10 Tue 10:29]--[2021-08-10 Tue 10:54] =>  0:25
CLOCK: [2021-08-10 Tue 09:57]--[2021-08-10 Tue 10:22] =>  0:25
CLOCK: [2021-08-10 Tue 09:21]--[2021-08-10 Tue 09:46] =>  0:25
CLOCK: [2021-08-09 Mon 14:41]--[2021-08-09 Mon 15:06] =>  0:25
CLOCK: [2021-08-09 Mon 14:08]--[2021-08-09 Mon 14:33] =>  0:25
CLOCK: [2021-08-09 Mon 13:23]--[2021-08-09 Mon 13:48] =>  0:25
CLOCK: [2021-08-09 Mon 11:52]--[2021-08-09 Mon 12:17] =>  0:25
CLOCK: [2021-08-09 Mon 11:18]--[2021-08-09 Mon 11:43] =>  0:25
CLOCK: [2021-08-09 Mon 10:48]--[2021-08-09 Mon 11:13] =>  0:25
CLOCK: [2021-08-09 Mon 09:58]--[2021-08-09 Mon 10:23] =>  0:25
CLOCK: [2021-08-09 Mon 09:28]--[2021-08-09 Mon 09:53] =>  0:25
CLOCK: [2021-08-09 Mon 08:57]--[2021-08-09 Mon 09:22] =>  0:25
CLOCK: [2021-08-09 Mon 08:25]--[2021-08-09 Mon 08:50] =>  0:25
CLOCK: [2021-08-06 Fri 15:17]--[2021-08-06 Fri 15:42] =>  0:25
CLOCK: [2021-08-06 Fri 14:47]--[2021-08-06 Fri 15:12] =>  0:25
CLOCK: [2021-08-04 Wed 12:09]--[2021-08-04 Wed 12:34] =>  0:25
CLOCK: [2021-08-04 Wed 11:17]--[2021-08-04 Wed 11:42] =>  0:25
CLOCK: [2021-08-04 Wed 10:11]--[2021-08-04 Wed 10:37] =>  0:26
CLOCK: [2021-08-04 Wed 09:40]--[2021-08-04 Wed 10:05] =>  0:25
CLOCK: [2021-08-04 Wed 09:09]--[2021-08-04 Wed 09:35] =>  0:26
CLOCK: [2021-08-03 Tue 15:16]--[2021-08-03 Tue 15:41] =>  0:25
CLOCK: [2021-08-03 Tue 13:48]--[2021-08-03 Tue 14:13] =>  0:25
CLOCK: [2021-08-03 Tue 13:17]--[2021-08-03 Tue 13:42] =>  0:25
CLOCK: [2021-08-03 Tue 11:19]--[2021-08-03 Tue 11:44] =>  0:25
CLOCK: [2021-08-03 Tue 10:44]--[2021-08-03 Tue 11:09] =>  0:25
CLOCK: [2021-08-03 Tue 10:06]--[2021-08-03 Tue 10:31] =>  0:25
CLOCK: [2021-08-03 Tue 09:36]--[2021-08-03 Tue 10:01] =>  0:25
CLOCK: [2021-08-03 Tue 09:05]--[2021-08-03 Tue 09:30] =>  0:25
:END:

Write some documentation comments for each function

What is Top in AccsSum?

In IntrfEnv are alias and v2mem the same?

Is the formula in cosmins paper wrong? It should be $offset1 >= offset2 +
shape2$ instead of $offset1 > offset2 + shape2$. And the shape should be
multiplied with the stride?

Also, I don't think it works with negative offsets, eg. ~disjoint [90, 81, ...,
9] [9, 18, ..., 90]~ should return false but returns true.

** DONE Symbolic simplifier
:LOGBOOK:
CLOCK: [2021-08-17 Tue 09:02]--[2021-08-17 Tue 09:15] =>  0:13
CLOCK: [2021-08-17 Tue 08:28]--[2021-08-17 Tue 08:53] =>  0:25
CLOCK: [2021-08-12 Thu 14:45]--[2021-08-12 Thu 15:11] =>  0:26
CLOCK: [2021-08-12 Thu 14:09]--[2021-08-12 Thu 14:34] =>  0:25
CLOCK: [2021-08-12 Thu 13:21]--[2021-08-12 Thu 13:46] =>  0:25
CLOCK: [2021-08-12 Thu 11:32]--[2021-08-12 Thu 11:57] =>  0:25
CLOCK: [2021-08-12 Thu 11:02]--[2021-08-12 Thu 11:27] =>  0:25
:END:

The idea is to take a ~TPrimExp Int64 VName~ and attempt to turn it into a sum
of products (perhaps nested?), with perhaps negation somewhere in there. Then we
can eliminate terms which are each others negation and so on. Further
simplifications are also possible, but let's keep it simple for now.

** DONE Modify pos2-fixed.fut_seq_mem the way we'd want the pass to
:LOGBOOK:
CLOCK: [2021-08-17 Tue 13:06]--[2021-08-17 Tue 13:31] =>  0:25
:END:

** DONE apply memory coalescing?
:LOGBOOK:
CLOCK: [2021-08-18 Wed 14:33]--[2021-08-18 Wed 14:58] =>  0:25
CLOCK: [2021-08-18 Wed 13:48]--[2021-08-18 Wed 14:13] =>  0:25
CLOCK: [2021-08-18 Wed 13:10]--[2021-08-18 Wed 13:35] =>  0:25
CLOCK: [2021-08-18 Wed 11:20]--[2021-08-18 Wed 11:45] =>  0:25
CLOCK: [2021-08-18 Wed 10:49]--[2021-08-18 Wed 11:14] =>  0:25
CLOCK: [2021-08-18 Wed 09:55]--[2021-08-18 Wed 10:20] =>  0:25
CLOCK: [2021-08-18 Wed 09:25]--[2021-08-18 Wed 09:50] =>  0:25
CLOCK: [2021-08-17 Tue 15:10]--[2021-08-17 Tue 15:35] =>  0:25
CLOCK: [2021-08-17 Tue 14:40]--[2021-08-17 Tue 15:05] =>  0:25
CLOCK: [2021-08-17 Tue 10:03]--[2021-08-17 Tue 10:28] =>  0:25
CLOCK: [2021-08-17 Tue 09:32]--[2021-08-17 Tue 09:57] =>  0:25
:END:

Turns out we cannot use ~substituteIndices~, because it doesn't work on GPUMem.

But perhaps we can just do it manually...

We need scope so we can perform a lookup like in explicitallocations:

#+begin_src haskell -n -r -l "-- ref:%s"
        let (_, val_res) = splitFromEnd num_vals res
        mem_ixfs <- mapM (subExpIxFun . resSubExp) val_res
        pure (res, mem_ixfs)
#+end_src

An example:

#+begin_src futhark -n -r -l "-- ref:%s"
  let (mem_if: mem, if_res: [n]i32 @ mem_if -> ixfun_if) =
    if ... then
      let mem_then = alloc ...
      res_then @ alloc -> ixfun_then = ...
      return (mem_then, res_then)
    else
      let mem_else = alloc ...
      res_else @ alloc -> ixfun_else = ...
      return (mem_else, res_else)
    : { mem, [n]i32 @ ?0 -> ixfun_ext }
#+end_src

We want to coalesce all those memory blocks into the same, so that it looks like this:

#+begin_src futhark -n -r -l "-- ref:%s"
  let (mem_if: mem, if_res: [n]i32 @ mem_b -> ixfun_if') =
    if ... then
      let mem_then = alloc ...
      res_then @ mem_b -> ixfun_then' = ...
      return (mem_then, res_then)
    else
      let mem_else = alloc ...
      res_else @ mem_b -> ixfun_else' = ...
      return (mem_else, res_else)
    : { mem, [n]i32 @ ?0 -> ixfun_ext }
#+end_src

Where all of ~ixfun_if'~, ~ixfun_then'~ and ~ixfun_else'~ are some modified
index functions. The question now is, what to do about the decoration on the
if-statement, eg. ~ixfun_ext~ and the existential memory ~?0~? We could try to
generalize and create a new existential index function, but then we might also
have to change the other results of the if-blocks (right now, the idea is to let
the simplifier remove any unused return values after the fact). Maybe I can use
~existentializeIxFun~ with the other return values from the if statement?

** DONE Only a single layer of sum of products in simplifier
:LOGBOOK:
CLOCK: [2021-08-20 Fri 11:02]--[2021-08-20 Fri 11:27] =>  0:25
CLOCK: [2021-08-20 Fri 10:29]--[2021-08-20 Fri 10:54] =>  0:25
CLOCK: [2021-08-20 Fri 09:59]--[2021-08-20 Fri 10:24] =>  0:25
CLOCK: [2021-08-20 Fri 09:28]--[2021-08-20 Fri 09:53] =>  0:25
:END:

(+ ((a+b)*(c+d)) should be turned in to ac + ad + bc + bd

